# SetEdgeReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnEdge..::..SetEdgeReference Method
PointOnEdge Class See Also
---
Change the edge or curve reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetEdgeReference(
	Reference reference
)
```

Visual Basic
---
```text
Public Sub SetEdgeReference ( _
	reference As Reference _
)
```

Visual C++
---
```text
public:
void SetEdgeReference(
	Reference^ reference
)
```

# ### Parameters
reference
    Type: Autodesk.Revit.DB..::..Reference
# Remarks
The referenced element may be any model element, including FamilyInstance, FormElement, or CurveElement. The reference must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR.
# See Also
PointOnEdge Class
Autodesk.Revit.DB Namespace